[
    {
        "title": "Gang rape happened to my sister",
        "body": "So, my sister recently shot herself in the leg due to mishandling a gun. It hit her femural artery and she was rushed to the hospital for emergency surgery, it’s a miracle she didn’t bleed out. She is still recovering and unable to walk and according to details from her and my family, she was just gang raped in this state. She contracted an STD and it has also spread into her wound. She is going through a horrible time, and I have no idea how to support her or if I should step into her life somehow. We grew up extremely close because we are fraternal twins. I have no other details, for example who the perpetrators could have been or when and where exactly it occurred-but she has been housebound. If anyone has any suggestions, please let me know. I may end up deleting this soon because obviously the details are very specific, and I feel strange about her story being online. ",
        "author": "Amazing-Ad2621",
        "created_utc": 1732167478.0,
        "score": 3,
        "num_comments": 11,
        "url": "https://www.reddit.com/r/rape/comments/1gw947c/gang_rape_happened_to_my_sister/",
        "is_video": false
    },
    {
        "title": "Was I raped?",
        "body": "A man I knew from work came back to my house for an afters, he knew I was in a relationship and knows my partner, he asked to kiss me and I said no. He then slapped me and told me to do it, after that he proceeded to go down on me and leave very harsh marks that are still there to this day. After this he attempted to penetrate me but didn't get it in, he thrusted many times and moaned as if it was, until I managed to push him off me. Did he rape me? I'm just really unsure ",
        "author": "Inneedofadvice20000",
        "created_utc": 1732156589.0,
        "score": 4,
        "num_comments": 3,
        "url": "https://www.reddit.com/r/rape/comments/1gw5r6f/was_i_raped/",
        "is_video": false
    },
    {
        "title": "I was molested by one of my hogh-schools more popular kids ",
        "body": "Im an trans girl i was cismale hetero presenting in school to avoid bullying, I am only recently started taking in what actually happened, at the time I didn't even realize i was molested specificly cause im autistic and i sturggle with  idetifiying situations(i was very innocent when it came to phyiscal contact at the time not consentualy doing stuff till l was out of school) ima describe what happened as I remember it and then give my thoughts \n\nWhat happened: I was hangingout with my friend group in the hallway at school my bullys cousin came up behind me, he pulled me against him, he prushed his hips into me, he wrapped his arms around my body low groping my Inner thigh essentially holding me there for a few seconds. He was stronger than me he was the star basketball and baseball player at our school i literaly couldn't get away from him, he whispered something in my ear i don't remember anymore what he said before he let go and walked away leaving no indication  to what he wanted one, of my friends asked if I was OK i acted unbothered \n\nMy thoughts at the time: I felt really embarrassed it literaly happened where people who I considered friends could see, I never wanted to my high-school friends to see me in a intimate position no matter what circumstances \n\nThoughts now: i have alot of trauma from 18 and below so i have memorys of stuff reapear randomly  which is difficult, I'm disgusted by his actions, I noticed I actually now struggle with pda i get similar symtoms to anxiety when happens, despite being attracted to guys I still don't trust them making dating difficult I actually lived as arrow ace for a while cause of it to avoid doing stuff with people not feeling comfortable with even partners for a while ",
        "author": "Justcause_Jc",
        "created_utc": 1732104208.0,
        "score": 1,
        "num_comments": 1,
        "url": "https://www.reddit.com/r/rape/comments/1gvnwwv/i_was_molested_by_one_of_my_hoghschools_more/",
        "is_video": false
    },
    {
        "title": "Life will go on and get better eventually, you just have to keep pushing through the days. Time, a support network and a therapist can be a huge help. Here's my story and path I took towards healing. ",
        "body": "When I was younger, I was pretty shy and self conscious. When I went to high school, things just went downhill from there fast. My body started to \"mature\" much more than other girls there, and coupled with my personality, that made me an easy target for bullying. I often faked being sick to not have to go to school and dreaded it. It was pretty miserable dealing with the other students there and I had to deal with creepy teachers at times too even. I didn't have many friends and was more of a loner.  \nI ended up experiencing SA for the first time pretty bad when I was 15 from someone I trusted like family (but not my actual family). I then went to a therapist who also betrayed my trust and groomed me for a little over a year too. Once I quit I got a bf and was finally able to start feeling better about myself and the world. Once I finished with high school and went to college, the social life and the fact that most people there were very chill and not the same kinds of people I had in high school. That's when my healing started to kick in the most. At 19, I am now finally in a healthy headspace and able to cope with what has happened to me in the past. I have a new bf now and a healthy sex life. There are parts of my SA that stick with me and pop into my head at times, but I don't think anyone can ever truly shed themselves 100% of their past, just cope with realizing it's a part of your history but you can move forward from there.\n\nOne thing I found to be helpful when those things were going on is having someone to talk to about it. It helped me get it off my mind and getting someone else's inputs really helped calm my nerves. There's multiple ways of finding free resources for this. A website called 7cups has trained listeners who can provide a listening ear to vent your thoughts too or reddit chat can be helpful as well, you just have to be careful about who you talk to. If anyone needs someone to talk to, please feel free to reach out to me or feel free to AMA as well if it will help you in your journey.\n\nI wish you all the best and remember to keep on keeping on and things will get better eventually, even if they don't seem like they will.",
        "author": "ExternalShy9207",
        "created_utc": 1732161180.0,
        "score": 0,
        "num_comments": 1,
        "url": "https://www.reddit.com/r/rape/comments/1gw79az/life_will_go_on_and_get_better_eventually_you/",
        "is_video": false
    },
    {
        "title": "I have a domination kink and I think its because I was raped",
        "body": "A month ago or so (16 at the time) I was raped by a close friend of mine, I have forgived her and we are still friends , Im still dependant of her, since she is usually my source of comfort, but after it happened I just want her to take care of me and dominate me, I want her to take my decisions for me, after she raped me I dont really feel comfortable with physical contact except if its with her, I think I have become even more dependant of her but now Im also developing weird kinks, is this normal? should I do something about it? (she is not manipulating me and I think I can trust her)",
        "author": "manteca4888",
        "created_utc": 1732150149.0,
        "score": 7,
        "num_comments": 3,
        "url": "https://www.reddit.com/r/rape/comments/1gw3gqa/i_have_a_domination_kink_and_i_think_its_because/",
        "is_video": false
    },
    {
        "title": "My gf was raped and it tearing me apart",
        "body": "So me and my girlfriend are very close and very broken, she's been raped many times before and I knew this, didn't effect my love for her and it still won't, recently she was raped by someone she used to know and let it slip to me, I feel so useless, she's bound and determined to help me even though I don't want it, but all I want is to help her, but she won't let me. So I make her sad, I can't help her and apparently I can't protect her, I feel so at fault, I'm in so much pain but I know she's in more, I just want to help but I don't know how, empathy isn't a strong sute and she won't let me try, I just want to give her a reason to love me, I just need help ",
        "author": "Content_Cup_9429",
        "created_utc": 1732145964.0,
        "score": 6,
        "num_comments": 2,
        "url": "https://www.reddit.com/r/rape/comments/1gw1xw8/my_gf_was_raped_and_it_tearing_me_apart/",
        "is_video": false
    },
    {
        "title": "How do I support my friend?",
        "body": "My friend was coerced into sexual activities by one of their friends and now feels uncomfortable around this friend. My friend felt comfortable telling me this, when I talked to them about it, I made sure that they only shared things they were comfortable sharing. I said they should tell their therapist about this (only if they think they’re ready to talk about it with the therapist), and they said they didn’t think they were comfortable doing so. My friend didn’t even really think they had been sexually assaulted because they didn’t know coercion into sexual activities is sexual assault. My friend has dealt with heavy suicidal thoughts and self harm in the past, and I want to provide as much support as possible so they don’t fall back into this. How do I support them and help them (A) understand how what their friend (B) did was wrong and its not wrong of them (A) to stop being friends with the person (B)?",
        "author": "Valuable_Ad_7878",
        "created_utc": 1732138318.0,
        "score": 2,
        "num_comments": 1,
        "url": "https://www.reddit.com/r/rape/comments/1gw01z9/how_do_i_support_my_friend/",
        "is_video": false
    },
    {
        "title": "Why am I doing this?",
        "body": "I was in a very abusive relationship when I was younger and I was sexually assaulted and raped several times over the course of the relationship. I have told my therapist what happened on each of these occasions. They confirmed that every single one of them was sexual assault/rape and tells me it's not my fault. And every single time I try to find a way to blame myself for what happened. I don't know why I do this. If someone told me an identical story to my own, I would tell them it wasn't their fault so why am I trying to blame myself for what happened?\n\nMaybe it's because I feel so powerless about what happened. Other than the 2 times I was unable to consent due to my state of consciousness/awareness, every other time, I gave clear and verbal \"no\" and on most of the times I also gave pretty clear non-verbal indications of non-consent, often multiple times, all of which were ignored. I was unable to stop him even though I wanted to.\n\n Maybe assigning blame to myself is me trying to feel like I had some control of the situation. I don't think it's healthy but I also don't know how to stop.",
        "author": "Downtown-Amphibian70",
        "created_utc": 1732133479.0,
        "score": 3,
        "num_comments": 1,
        "url": "https://www.reddit.com/r/rape/comments/1gvyy37/why_am_i_doing_this/",
        "is_video": false
    },
    {
        "title": "UPDATE: I think my husband came in my mouth while I was asleep",
        "body": "I wanted to give everyone an update on my previous post: https://www.reddit.com/r/rape/comments/1gqiq7x/i\\_think\\_my\\_husband\\_came\\_in\\_my\\_mouth\\_while\\_i\\_was/\n\nThe day I posted that, I decided to go stay the night with my sister. That night he blew up my phone with texts and calls. I ignored them. The next morning he texted me and said he had proof of his innocence. I decided to meet up with him for lunch to see what it was.\n\nThe night of the incident, he was playing xbox with friends online when I went to bed. He showed me some messages and timestamps from when he told them he was signing off. He then showed me some messages and timestamps from some instagram reels he sent to his friends. He claims he was in our bed at this point.\n\nSide note: before I went on my meds, he and I started using an app to track our sleep. I guess he's been using it this whole time and showed me when the app logged him as asleep. There's like a 15-20 minute time period where he's in bed, but not asleep and that's when the incident would have had to occur, because the app says he was asleep the whole night.\n\nIn his words, if he was to have violated me in that 15 minute period, he would have been all riled up and unable to sleep. He also mentioned that my meds can sometimes have a side effect of confusion or anxiety.\n\nI started to believe him and question whether or not the whole ordeal ever happened. I decided to go back home with him that night and that we would try to get through this together.\n\nBefore I went home, my sister lent me an old nanny cam she had. I set it up in secret from my husband. Each morning, after he would leave for work, I'd review the footage from the night before. Nothing noteworthy was captured. I'd go to bed early each night after taking my meds, then he'd get in the bed like an hour later. Sometimes he'd snuggle or give me a kiss on the forehead, but then he'd go to sleep soon after.\n\nDespite all of this, I still felt off. I was still having a hard time trusting him. This morning when I went to check the camera, I discovered that I had been right all along.\n\nAbout an hour after I had gone to sleep last night, he walked into the room and said my name softly. I don't budge. I'm deep asleep. He then walks over to me and lifts up my shirt. He takes his phone out and it looks like he's taking pics or possibly filming me. Then he puts his hand down my panties and starts touching me, then he starts touching himself. He steps out of the room for a bit and comes back with his pants off and is holding a washcloth. He then starts pleasuring himself right next to my face. After a minute or so he presses himself up against my face and finishes. Then he wipes my mouth and the side of my face with the washcloth and steps out of our room. A few minutes later he gets in bed to sleep.\n\nI'm in shock. I can't believe that he did it again! I'm also shocked that I caught him! I'm so fucking angry and hurt and disgusted. I’m crying while I type this. I'm leaving this fucker today and never coming back.\n\nThank you to those that were supportive and recommended setting up a camera.\n\n",
        "author": "ta_scared_2_sleep",
        "created_utc": 1732126439.0,
        "score": 57,
        "num_comments": 16,
        "url": "https://www.reddit.com/r/rape/comments/1gvw22b/update_i_think_my_husband_came_in_my_mouth_while/",
        "is_video": false
    },
    {
        "title": "Ex boyfriend raped me",
        "body": "It was about 15 years ago. I have a child with him. When we were together he raped me repeatedly, including with his friends. Looking back I am angry I didn't do anything about it. I was only 20 at the time. It took me a long time to move forward, I still haven't really. \n\nHe apologised to me the other day after all these years. It has all just resurfaced again.",
        "author": "PralineMaster7404",
        "created_utc": 1732117995.0,
        "score": 11,
        "num_comments": 3,
        "url": "https://www.reddit.com/r/rape/comments/1gvsmoc/ex_boyfriend_raped_me/",
        "is_video": false
    }
]